app/views/courses/my_courses.html.erb

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = 1 AND "enrollments"."course_id" = 1 LIMIT 1
---
          <% if current_user %>
            <% enrollment = Enrollment.find_by(user: current_user, course: course) %>