app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" INNER JOIN "enrollments" ON "courses"."id" = "enrollments"."course_id" WHERE "enrollments"."user_id" = 1
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = 4
---
  def my_courses
    # Курси, на які підписаний користувач через enrollments
    @courses = current_user.enrolled_courses.includes(:enrollments)

INSERT INTO "courses" ("title", "description", "category", "created_at", "updated_at", "image", "user_id") VALUES ('ООП', 'Найкращий курс в цілому світі!!!!!', 'Programing', '2025-06-01 18:14:25.445963', '2025-06-01 18:14:25.445963', 'https://cdn.pixabay.com/photo/2024/02/28/07/42/european-shorthair-8601492_640.jpg', 4) RETURNING "id"
---
  def create
    @course = current_user.courses.build(course_params)

    if @course.save