app/controllers/enrollments_controller.rb

INSERT INTO "enrollments" ("user_id", "course_id", "status", "created_at", "updated_at") VALUES (1, 1, 'pending', '2025-05-28 22:53:51.874191', '2025-05-28 22:53:51.874191') RETURNING "id"
---
  def create
    @enrollment = Enrollment.new(course_id: params[:course_id])
    @enrollment.user = current_user
    @enrollment.status = "pending"

    if @enrollment.save

DELETE FROM "enrollments" WHERE "enrollments"."id" = 1
---
  def destroy
    @enrollment.destroy!

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = 1 LIMIT 1
---
    def set_enrollment
      @enrollment = Enrollment.find(params.expect(:id))