app/controllers/lessons_controller.rb

  def create
    @lesson = @course.lessons.build(lesson_params)
    @lesson.user = current_user  # Прив’язка автора уроку

    if @lesson.save
---
INSERT INTO "lessons" ("title", "content", "course_id", "created_at", "updated_at", "user_id") VALUES ('Ну це тест', 'лЩІващ ілщь ілщ ьільщ пільщ пльіщв альщіва льівальщ ', 2, '2025-06-01 19:46:50.791047', '2025-06-01 19:46:50.791047', 4) RETURNING "id"

  def set_lesson
    @lesson = @course.lessons.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = 2 AND "lessons"."id" = 1 LIMIT 1