app/controllers/users_controller.rb

UPDATE "users" SET "updated_at" = '2025-06-02 22:24:18.141216' WHERE "users"."id" = 4
---
  def update
    if @user.update(user_params)