app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "role", "created_at", "updated_at") VALUES ('WishText', 'tets@test.com', '1234', '1234', '2025-05-28 21:37:49.221083', '2025-05-28 21:37:49.221083') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "updated_at" = '2025-06-02 22:24:18.141216' WHERE "users"."id" = 4
---
  def update
    respond_to do |format|
      if @user.update(user_params)